load_tests/tsung-script.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="whogoesthere.c2y2jbcu8i.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <!-- 1 user every 10 seconds --> 
  <load>
    <arrivalphase phase="1" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Hit All Endpoints" probability="100" type="ts_http">
      
      <transaction name="Create_New_User">

        <request>
          <dyn_variable name="authenticity_token"/>
          <http url='/users/new.html'></http>
        </request>

        <!-- Grab and format authenticity token -->
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token"/>
        </setdynvars>

        <!-- Homepage -->
        <request subst="true">
          <http url='/'></http>
        </request>
        
        <!-- Create new user -->
        <request subst="true">
          <dyn_variable name="created_user_id" re="Location: http://.*/users/(.*)\r"/>
          <http url='/users' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=whogoesthere&amp;user%5Bemail%5D=test%%ts_user_server:get_unique_id%%@gmail.com" method='POST'></http>
        </request>

        <!-- Redirect to /users/created_user_id -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%'></http>
        </request>

        <!-- Update user -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=new-whogoesthere&amp;user%5Bemail%5D=%%_created_user_id%%@gmail.com" method='PUT'></http>
        </request>

        <!-- Redirect to /users/created_user_id -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%'></http>
        </request>

      </transaction>

      <transaction name="Create_New_Event">
         
        <!-- Go to /users/created_user_id/events -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%/events'></http>
        </request>

        <!-- Submit new event -->
        <request subst="true">
          <dyn_variable name="created_event_id" re='"id\":(.*),\"name\":\"Yoga'/> 
          <http url='/users/%%_created_user_id%%/events' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;event%5Buser_id%5D=%%_created_user_id%%&amp;event%5Bname%5D=Yoga&amp;event%5Bdescription%5D=Downdawg&amp;event%5Blocation%5D=Park&amp;event%5Bstart_time(1i)%5D=2019&amp;event%5Bstart_time(2i)%5D=11&amp;event%5Bstart_time(3i)%5D=12&amp;event%5Bstart_time(4i)%5D=23&amp;event%5Bstart_time(5i)%5D=24&amp;event%5Bend_time(1i)%5D=2019&amp;event%5Bend_time(2i)%5D=11&amp;event%5Bend_time(3i)%5D=12&amp;event%5Bend_time(4i)%5D=23&amp;event%5Bend_time(5i)%5D=24" method='POST'></http>
        </request>

        <!-- Redirect to /users/created_user_id/events -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%/events'></http>
        </request>

        <!-- Go to /events/created_event_id -->
        <request subst="true">
          <http url='/events/%%_created_event_id%%'></http>
        </request>

        <!-- PUT /events/created_event_id/ -->
        <request subst="true">
          <http url='/events/%%_created_event_id%%' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;event%5Buser_id%5D=%%_created_user_id%%&amp;event%5Bname%5D=Yogaaa&amp;event%5Bdescription%5D=Downdawg&amp;event%5Blocation%5D=Park&amp;event%5Bstart_time(1i)%5D=2019&amp;event%5Bstart_time(2i)%5D=11&amp;event%5Bstart_time(3i)%5D=12&amp;event%5Bstart_time(4i)%5D=23&amp;event%5Bstart_time(5i)%5D=24&amp;event%5Bend_time(1i)%5D=2019&amp;event%5Bend_time(2i)%5D=11&amp;event%5Bend_time(3i)%5D=12&amp;event%5Bend_time(4i)%5D=23&amp;event%5Bend_time(5i)%5D=24" method='PUT'></http>
        </request>

        <!-- Redirect to /users/created_user_id/events -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%/events'></http>
        </request>

        <!-- Go to /events/created_event_id -->
        <request subst="true">
          <http url='/events/%%_created_event_id%%'></http>
        </request>

      </transaction>

      <transaction name="Create_Invitations">

        <!-- Go to /events/created_event_id/invitations -->
        <request subst="true">
          <http url='/events/%%_created_event_id%%/invitations'></http>
        </request>

        <!-- Create new invitation (to self) -->
        <request subst="true">
          <dyn_variable name="created_invitation_id" re='"id\":(.*),\"user_id'/>
          <http url='/events/%%_created_event_id%%/invitations' contents="authenticity_token=%%_authenticity_token%%&amp;invitation%5Buser_id%5D=%%_created_user_id%%" method='POST'></http>
        </request>

        <!-- Create new comment -->
        <request subst="true">
          <dyn_variable name="created_comment_id" re='"id\":(.*),\"user_id'/>
          <http url='/events/%%_created_event_id%%/comments' contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Buser_id%5D=%%_created_user_id%%&amp;comment%5Bbody%5D=message" method='POST'></http>
        </request>

        <!-- Delete invitation -->
        <!--
        <request subst="true">
          <http url='/comments/%%_created_event_id%%' version='1.1' method='DELETE'></http>
        </request> -->

        <!-- Delete event -->
        <request subst="true">
          <http url='/events/%%_created_event_id%%' version='1.1' method='DELETE'></http>
        </request>

        <!-- Delete user -->
        <request subst="true">
          <http url='/users/%%_created_user_id%%' version='1.1' method='DELETE'></http>
        </request>
    
    </transaction>

    </session>
  </sessions>
</tsung>